SOAPUtil/bin/msg/IDAACTL_RQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<IDAActI xmlns="http://com.seagullsw.appinterface/LegasuiteCICSEngine">
			<LK-MST-API-REQUEST-AREA xmlns="">
				<LK-API>IDAI020</LK-API>
				<LK-MST-API-DAS-ID>701</LK-MST-API-DAS-ID>
				<LK-MST-API-ACCESS-TYPE>1</LK-MST-API-ACCESS-TYPE>
				<LK-MST-API-ACCT-MSTR-REQ-MAP>
					<LK-MST-MAP-ACCOUNT-GENERAL-SEC>
						<LK-MST-F-ACCT-MASTER-INDEX>1</LK-MST-F-ACCT-MASTER-INDEX>
						<LK-MST-F-ACCT-GENERAL-DTL>1</LK-MST-F-ACCT-GENERAL-DTL>
						<LK-MST-F-ACCT-STATUS-DTL>1</LK-MST-F-ACCT-STATUS-DTL>
						<LK-MST-F-ACCT-WAIVE-CHARGE-DTL>1</LK-MST-F-ACCT-WAIVE-CHARGE-DTL>
						<LK-MST-F-ACCT-STATISTICS-DTL>1</LK-MST-F-ACCT-STATISTICS-DTL>
						<LK-MST-F-ACCT-STMT-DISP-DTL>1</LK-MST-F-ACCT-STMT-DISP-DTL>
						<LK-MST-F-ACCT-MISC-DTL>1</LK-MST-F-ACCT-MISC-DTL>
						<LK-MST-F-ACCT-CONTROL-INFO>1</LK-MST-F-ACCT-CONTROL-INFO>
						<LK-MST-F-ACCT-CLOSED-INFO>1</LK-MST-F-ACCT-CLOSED-INFO>
						<LK-MST-F-ACCT-PERIODIC-TRF-DTL>1</LK-MST-F-ACCT-PERIODIC-TRF-DTL>
					</LK-MST-MAP-ACCOUNT-GENERAL-SEC>
					<LK-MST-MAP-CUSTOMER-INFO>
						<LK-MST-F-ACCT-TUTOR-DTL>1</LK-MST-F-ACCT-TUTOR-DTL>
						<LK-MST-F-ACCT-COURT-DTL>1</LK-MST-F-ACCT-COURT-DTL>
					</LK-MST-MAP-CUSTOMER-INFO>
					<LK-MST-MAP-CHECKING-SECTION>
						<LK-MST-F-CHECKING-GENERAL-DTL>1</LK-MST-F-CHECKING-GENERAL-DTL>
						<LK-MST-F-CHECKING-STATISTICS>1</LK-MST-F-CHECKING-STATISTICS>
						<LK-MST-F-CHECKING-AGG-BAL>1</LK-MST-F-CHECKING-AGG-BAL>
					</LK-MST-MAP-CHECKING-SECTION>
					<LK-MST-MAP-RESERVE-SECTION>
						<LK-MST-F-RESERVE-GENERAL-DTL>1</LK-MST-F-RESERVE-GENERAL-DTL>
						<LK-MST-F-RESERVE-CREDIT-LINE>1</LK-MST-F-RESERVE-CREDIT-LINE>
						<LK-MST-F-RESERVE-DELQ-DTL>1</LK-MST-F-RESERVE-DELQ-DTL>
						<LK-MST-F-RESERVE-ARREARS>1</LK-MST-F-RESERVE-ARREARS>
						<LK-MST-F-RESERVE-STATISTICS>1</LK-MST-F-RESERVE-STATISTICS>
						<LK-MST-F-RESERVE-MISC-DTL>1</LK-MST-F-RESERVE-MISC-DTL>
					</LK-MST-MAP-RESERVE-SECTION>
					<LK-MST-MAP-SAVINGS-SECTION>
						<LK-MST-F-SAVINGS-GENERAL-DTL>1</LK-MST-F-SAVINGS-GENERAL-DTL>
						<LK-MST-F-SAVINGS-AGG-BAL>1</LK-MST-F-SAVINGS-AGG-BAL>
						<LK-MST-F-SAVINGS-STATISTICS>1</LK-MST-F-SAVINGS-STATISTICS>
					</LK-MST-MAP-SAVINGS-SECTION>
				</LK-MST-API-ACCT-MSTR-REQ-MAP>
				<LK-MST-API-APPL-ID>LEG</LK-MST-API-APPL-ID>
				<LK-MST-API-SOURCE-PGM>ACCTINQM</LK-MST-API-SOURCE-PGM>
				<LK-MST-API-USER-ID>S682153</LK-MST-API-USER-ID>
				<LK-MST-API-TRAN-ID>XWAA</LK-MST-API-TRAN-ID>
				<LK-MST-API-TERMINAL-ID>XWAA</LK-MST-API-TERMINAL-ID>
				<LK-MST-ACCT-MSTR-INPUT-DATA>
					<LK-MST-ACCOUNT-NUMBER>019598661</LK-MST-ACCOUNT-NUMBER>
				</LK-MST-ACCT-MSTR-INPUT-DATA>
			</LK-MST-API-REQUEST-AREA>
		</IDAActI>
	</soapenv:Body>
</soapenv:Envelope>